popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/
/**
 * \file     bdrv.h
 *
 * \brief    Bridge Driver low level access library
 *
 * \version  V0.8.1
 * \date     05. Jul 2022
 *
 * \note
 */

/** \addtogroup BDRV_api
 *  @{
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** DM           Daniel Mysliwitz                                              **
** BG           Blandine Guillot                                              **
** JO           Julia Ott                                                     **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.1.0: 2019-10-28, DM:   Initial version                                  **
** V0.2.0: 2019-11-18, BG:   Added functions                                  **
** V0.3.0: 2020-04-28, BG:   Updated revision history format                  **
** V0.4.0: 2020-07-10, BG:   Added inline functions list                      **
** V0.5.0: 2020-08-19, BG:   Added BEMF functions                             **
** V0.6.0: 2020-09-16, BG:   Added interrupt enable/disable functions         **
**                           ChargePump init separated, init code enabled     **
** V0.6.1: 2020-10-06, BG:   EP-492: Removed MISRA 2012 errors                **
** V0.6.2: 2020-10-16, JO:   EP-523: Updated doxygen documentation            **
** V0.6.3: 2020-10-20, BG:   EP-532: Updated cast in BDRV_getFaults()         **
** V0.6.4: 2020-10-21, BG:   EP-539: Considered the enable checkbox in CW in  **
**                           the initialization function                      **
** V0.6.5: 2020-11-12, JO:   EP-590: Removed \param none and \return none to  **
**                           avoid doxygen warning                            **
**                           Added end of group for doxygen                   **
** V0.6.6: 2020-11-16, BG:   EP-595: Updated BDRV initialisation              **
** V0.6.7: 2020-11-20, BG:   EP-610: Corrected MISRA 2012 errors              **
**                           The following rules are globally deactivated:    **
**                           - Info 774: Boolean within 'if' always evaluates **
**                             to False/True                                  **
**                           - Warning 685: Relational operator '<=' always   **
**                             evaluates to 'true'                            **
** V0.6.8: 2020-12-18, BG:   EP-652: Corrected name of error code variable    **
** V0.6.9: 2021-02-10, JO:   EP-696: Changed from anonymous to named typedefs **
**                           to prevent MISRA warning                         **
** V0.7.0: 2021-04-06, BG:   EP-760: Replaced if instructions to check if the **
**                           module is enabled with preprocessor directives to**
**                           avoid compiler warnings                          **
** V0.7.1: 2021-04-29, JO:   EP-789: Updated 3 phase handling                 **
** V0.7.2: 2021-06-02, BG:   EP-816: Added missing bitfield settings in the   **
**                           function BDRV_setBridge                          **
**                           Added SCU_delay_us functions in the diagnostic   **
**                           functions BDRV_checkShortDiagnosis and           **
**                           BDRV_checkOpenLoad                               **
**                           Corrected the DS threshold in BDRV_checkOpenLoad **
** V0.7.3: 2021-07-21, BG:   EP-871: Replaced if-condition by switch so that  **
**                           a wrong error code is returned for 3-phase device**
**                           in the functions BDRV_set{LS/HS}{Chrg/Dischrg}...**
**                           ...{Constant/Sequencer}Mode                      **
** V0.7.4: 2021-07-27, BG:   EP-814: Corrected the value to clear the register**
**                           STSCLR                                           **
** V0.7.5: 2021-07-30, BG:   EP-877: Corrected MISRA 2012 errors              **
** V0.7.6: 2021-08-04, BG:   EP-879: Updated BDRV_init() with extra accessors **
**                           for charge pump register                         **
**                           Corrected the value for the CP stages number in  **
**                           while-loop condition                             **
**                           Updated limits for CP voltage comparison to VSD  **
** V0.7.7: 2021-09-29, BG:   EP-880: Updated BDRV_setBridge(..) so that the   **
**                           function does not violate HW requirements when   **
**                           called with specific arguments                   **
** V0.7.8: 2021-11-08, BG:   EP-790: Combined struct typedef for charge and   **
**                           discharge, renamed existing struct elements for  **
**                           active driver, added elements for free-wheeling  **
**                           driver                                           **
**                           Updated functions according to the AK design step**
**                           BDRV_set{LS/HS}{Chrg/Dischrg}{Const/Seq}Mode     **
** V0.7.9: 2021-11-12, JO:   EP-937: Updated copyright and branding           **
** V0.8.0: 2022-06-23, JO:   EP-1150: Removed ARMCC V6.18 warnings            **
** V0.8.1: 2022-07-05, JO:   EP-1188: Disabled MISRA rule 9031 locally        **
*******************************************************************************/

#ifndef BDRV_H
#define BDRV_H

