popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/

#include "types.h"
#include "tle989x.h"
#include "tle_variants.h"
#include "bdrv_defines.h"

/*******************************************************************************
**                        Global Constant Declarations                        **
*******************************************************************************/

/*******************************************************************************
**                          Global Type Declarations                          **
*******************************************************************************/

/** \enum tBDRV_chCfg
 *  \brief This enum lists the bridge driver channel configuration
 */
typedef enum BDRV_chCfg
{
  BDRV_chCfg_off   = 0u,            /** <@brief Channel disabled */
  BDRV_chCfg_en    = 1u,            /** <@brief Channel enabled */
  BDRV_chCfg_pwm   = 2u,            /** <@brief Channel enabled with PWM (CCU7 connection) */
  BDRV_chCfg_on    = 3u,            /** <@brief Channel enabled and static on */
  BDRV_chCfg_hsDcs = 4u             /** <@brief Channel enabled with diagnosis current source (only for HSx)  */
} tBDRV_chCfg;

/** \enum tBDRV_hb
 *  \brief This enum lists the half-bridges
 */
typedef enum BDRV_hb
{
  BDRV_hb_1 = 1u,
  BDRV_hb_2 = 2u,
#if (UC_SERIES == 989)
  BDRV_hb_3 = 3u
#endif
} tBDRV_hb;

/** \enum tBDRV_offStateDiag
 *  \brief This enum lists the states for off-state detection
 */
typedef enum BDRV_offStateDiag
{
  BDRV_offStateDiag_ok = 0u,
  BDRV_offStateDiag_short2gnd = 1u,
  BDRV_offStateDiag_short2bat = 2u,
  BDRV_offStateDiag_openload = 3u
} tBDRV_offStateDiag;

/** \struct tBDRV_offState
 *  \brief This struct lists the off-state diagnosis status for every phase
 */
typedef struct BDRV_offState
{
  bool b_globFailSts;
  tBDRV_offStateDiag e_offStateDiagPhase1;
  tBDRV_offStateDiag e_offStateDiagPhase2;
#if (UC_SERIES == 989)
  tBDRV_offStateDiag e_offStateDiagPhase3;
#endif
} tBDRV_offState;

/** \enum tBDRV_currentCfg
 *  \brief This enum lists the gate currents
 */
typedef enum BDRV_currentCfg
{
  BDRV_currentCfg_5mA   = 0u,
  BDRV_currentCfg_6mA   = 1u,
  BDRV_currentCfg_7mA   = 2u,
  BDRV_currentCfg_9mA   = 3u,
  BDRV_currentCfg_11mA  = 4u,
  BDRV_currentCfg_13mA  = 5u,
  BDRV_currentCfg_15mA  = 6u,
  BDRV_currentCfg_18mA  = 7u,
  BDRV_currentCfg_21mA  = 8u,
  BDRV_currentCfg_24mA  = 9u,
  BDRV_currentCfg_27mA  = 10u,
  BDRV_currentCfg_31mA  = 11u,
  BDRV_currentCfg_34mA  = 12u,
  BDRV_currentCfg_38mA  = 13u,
  BDRV_currentCfg_42mA  = 14u,
  BDRV_currentCfg_46mA  = 15u,
  BDRV_currentCfg_50mA  = 16u,
  BDRV_currentCfg_54mA  = 17u,
  BDRV_currentCfg_58mA  = 18u,
  BDRV_currentCfg_63mA  = 19u,
  BDRV_currentCfg_67mA  = 20u,
  BDRV_currentCfg_72mA  = 21u,
  BDRV_currentCfg_77mA  = 22u,
  BDRV_currentCfg_82mA  = 23u,
  BDRV_currentCfg_87mA  = 24u,
  BDRV_currentCfg_92mA  = 25u,
  BDRV_currentCfg_97mA  = 26u,
  BDRV_currentCfg_103mA = 27u,
  BDRV_currentCfg_108mA = 28u,
  BDRV_currentCfg_114mA = 29u,
  BDRV_currentCfg_119mA = 30u,
  BDRV_currentCfg_125mA = 31u,
  BDRV_currentCfg_131mA = 32u,
  BDRV_currentCfg_137mA = 33u,
  BDRV_currentCfg_143mA = 34u,
  BDRV_currentCfg_149mA = 35u,
  BDRV_currentCfg_155mA = 36u,
  BDRV_currentCfg_161mA = 37u,
  BDRV_currentCfg_167mA = 38u,
  BDRV_currentCfg_174mA = 39u,
  BDRV_currentCfg_180mA = 40u,
  BDRV_currentCfg_187mA = 41u,
  BDRV_currentCfg_194mA = 42u,
  BDRV_currentCfg_200mA = 43u,
  BDRV_currentCfg_207mA = 44u,
  BDRV_currentCfg_214mA = 45u,
  BDRV_currentCfg_221mA = 46u,
  BDRV_currentCfg_228mA = 47u,
  BDRV_currentCfg_235mA = 48u,
  BDRV_currentCfg_242mA = 49u,
  BDRV_currentCfg_249mA = 50u,
  BDRV_currentCfg_257mA = 51u,
  BDRV_currentCfg_264mA = 52u,
  BDRV_currentCfg_272mA = 53u,
  BDRV_currentCfg_279mA = 54u,
  BDRV_currentCfg_287mA = 55u,
  BDRV_currentCfg_294mA = 56u,
  BDRV_currentCfg_302mA = 57u,
  BDRV_currentCfg_310mA = 58u,
  BDRV_currentCfg_318mA = 59u,
  BDRV_currentCfg_326mA = 60u,
  BDRV_currentCfg_334mA = 61u,
  BDRV_currentCfg_342mA = 62u,
  BDRV_currentCfg_350mA = 63u
} tBDRV_currentCfg;

/*=============================== CONSTANT MODE ==============================*/

/* Remove warnings for padding structures */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wpadded"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/** \struct tBDRV_constCfg
 *  \brief This struct lists the configuration in constant mode for one half-bridge
 */
typedef struct
{
  tBDRV_currentCfg e_constCurrentAct;           /** <@brief Constant current of the active driver */
  uint16 u16_constTimeAct_ns;                   /** <@brief Constant time of the active driver */
  tBDRV_currentCfg e_constCurrentFW;            /** <@brief Constant current of the free-wheeling driver */
  uint16 u16_constTimeFW_ns;                    /** <@brief Constant time of the free-wheeling driver */
} tBDRV_constCfg;


/*============================== SEQUENCER MODE ==============================*/

/** \struct tBDRV_seqCfg
 *  \brief This struct lists the configuration in sequencer mode for one half-bridge
 */
typedef struct
{
  tBDRV_currentCfg e_seqPhase1CurrentAct;       /** <@brief Sequencer current, phase 1 of the active driver */
  tBDRV_currentCfg e_seqPhase2CurrentAct;       /** <@brief Sequencer current, phase 2 of the active driver */
  tBDRV_currentCfg e_seqPhase3CurrentAct;       /** <@brief Sequencer current, phase 3 of the active driver */
  tBDRV_currentCfg e_seqPhase4CurrentAct;       /** <@brief Sequencer current, phase 4 of the active driver */
  uint16 u16_seqPhase1TimeAct_ns;               /** <@brief Sequencer time, phase 1 of the active driver */
  uint16 u16_seqPhase2TimeAct_ns;               /** <@brief Sequencer time, phase 2 of the active driver */
  uint16 u16_seqPhase3TimeAct_ns;               /** <@brief Sequencer time, phase 3 of the active driver */
  uint16 u16_seqPhase4TimeAct_ns;               /** <@brief Sequencer time, phase 4 of the active driver */
  tBDRV_currentCfg e_constCurrentFW;            /** <@brief Constant current of the free-wheeling driver */
  uint16 u16_constTimeFW_ns;                    /** <@brief Constant time of the free-wheeling driver */
} tBDRV_seqCfg;

/*============================ ADAPTIVE SEQUENCER ============================*/

/** \struct tBDRV_aseqCfg
 *  \brief This struct lists the configuration for adaptive sequencer for one half-bridge
 */
typedef struct
{
  tBDRV_currentCfg e_aseqMinCurrent;
  uint16 u16_aseqMinTime_ns;
  tBDRV_currentCfg e_aseqMaxCurrent;
  uint16 u16_aseqMaxTime_ns;
} tBDRV_aseqCfg;

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif

