popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/*******************************************************************************
**                        Global Function Declarations                        **
*******************************************************************************/

/*=================================== BDRV ===================================*/

sint8 BDRV_init(void);
sint8 BDRV_initCP(void);
#if (UC_SERIES == 988)
  sint8 BDRV_setBridge(tBDRV_chCfg e_ls1Cfg, tBDRV_chCfg e_hs1Cfg, tBDRV_chCfg e_ls2Cfg, tBDRV_chCfg e_hs2Cfg);
#elif (UC_SERIES == 989)
  sint8 BDRV_setBridge(tBDRV_chCfg e_ls1Cfg, tBDRV_chCfg e_hs1Cfg, tBDRV_chCfg e_ls2Cfg, tBDRV_chCfg e_hs2Cfg, tBDRV_chCfg e_ls3Cfg, tBDRV_chCfg e_hs3Cfg);
#endif
sint8 BDRV_setLSChrgConstMode(tBDRV_hb e_hb, tBDRV_constCfg s_constChrgCfg);
sint8 BDRV_setHSChrgConstMode(tBDRV_hb e_hb, tBDRV_constCfg s_constChrgCfg);
sint8 BDRV_setLSDischrgConstMode(tBDRV_hb e_hb, tBDRV_constCfg s_constDischrgCfg);
sint8 BDRV_setHSDischrgConstMode(tBDRV_hb e_hb, tBDRV_constCfg s_constDischrgCfg);
sint8 BDRV_setLSChrgSeqMode(tBDRV_hb e_hb, tBDRV_seqCfg s_seqChrgCfg);
sint8 BDRV_setHSChrgSeqMode(tBDRV_hb e_hb, tBDRV_seqCfg s_seqChrgCfg);
sint8 BDRV_setLSDischrgSeqMode(tBDRV_hb e_hb, tBDRV_seqCfg s_seqDischrgCfg);
sint8 BDRV_setHSDischrgSeqMode(tBDRV_hb e_hb, tBDRV_seqCfg s_seqDischrgCfg);
sint8 BDRV_setChrgAdaptSeqMode(tBDRV_aseqCfg s_aseqChrgCfg);
sint8 BDRV_setDischrgAdaptSeqMode(tBDRV_aseqCfg s_aseqDischrgCfg);
tBDRV_offState BDRV_checkShortDiagnosis(void);
tBDRV_offState BDRV_checkOpenLoad(void);
bool BDRV_getFaultSts(void);
uint8 BDRV_getFaults(void);
void BDRV_clrFaultSts(void);
INLINE void BDRV_enExternalLS1MosfetOvercurrentInt(void);
INLINE void BDRV_enExternalHS1MosfetOvercurrentInt(void);
INLINE void BDRV_enExternalLS2MosfetOvercurrentInt(void);
INLINE void BDRV_enExternalHS2MosfetOvercurrentInt(void);
INLINE void BDRV_enExternalLS3MosfetOvercurrentInt(void);
INLINE void BDRV_enExternalHS3MosfetOvercurrentInt(void);
INLINE void BDRV_enLS1DrainSrcMonitoringInt(void);
INLINE void BDRV_enHS1DrainSrcMonitoringInt(void);
INLINE void BDRV_enLS2DrainSrcMonitoringInt(void);
INLINE void BDRV_enHS2DrainSrcMonitoringInt(void);
INLINE void BDRV_enLS3DrainSrcMonitoringInt(void);
INLINE void BDRV_enHS3DrainSrcMonitoringInt(void);
INLINE void BDRV_enHB1AdaptSeqInt(void);
INLINE void BDRV_enHB2AdaptSeqInt(void);
INLINE void BDRV_enHB3AdaptSeqInt(void);
INLINE void BDRV_enHB1ActDrvDetectInt(void);
INLINE void BDRV_enHB2ActDrvDetectInt(void);
INLINE void BDRV_enHB3ActDrvDetectInt(void);
INLINE void BDRV_enDrvSeqErrInt(void);
INLINE void BDRV_enCPUndervoltageCompInt(void);
INLINE void BDRV_disExternalLS1MosfetOvercurrentInt(void);
INLINE void BDRV_disExternalHS1MosfetOvercurrentInt(void);
INLINE void BDRV_disExternalLS2MosfetOvercurrentInt(void);
INLINE void BDRV_disExternalHS2MosfetOvercurrentInt(void);
INLINE void BDRV_disExternalLS3MosfetOvercurrentInt(void);
INLINE void BDRV_disExternalHS3MosfetOvercurrentInt(void);
INLINE void BDRV_disLS1DrainSrcMonitoringInt(void);
INLINE void BDRV_disHS1DrainSrcMonitoringInt(void);
INLINE void BDRV_disLS2DrainSrcMonitoringInt(void);
INLINE void BDRV_disHS2DrainSrcMonitoringInt(void);
INLINE void BDRV_disLS3DrainSrcMonitoringInt(void);
INLINE void BDRV_disHS3DrainSrcMonitoringInt(void);
INLINE void BDRV_disHB1AdaptSeqInt(void);
INLINE void BDRV_disHB2AdaptSeqInt(void);
INLINE void BDRV_disHB3AdaptSeqInt(void);
INLINE void BDRV_disHB1ActDrvDetectInt(void);
INLINE void BDRV_disHB2ActDrvDetectInt(void);
INLINE void BDRV_disHB3ActDrvDetectInt(void);
INLINE void BDRV_disDrvSeqErrInt(void);
INLINE void BDRV_disCPUndervoltageCompInt(void);
INLINE uint8 BDRV_getExternalLS1MosfetOvercurrentSts(void);
INLINE uint8 BDRV_getExternalHS1MosfetOvercurrentSts(void);
INLINE uint8 BDRV_getExternalLS2MosfetOvercurrentSts(void);
INLINE uint8 BDRV_getExternalHS2MosfetOvercurrentSts(void);
INLINE uint8 BDRV_getExternalLS3MosfetOvercurrentSts(void);
INLINE uint8 BDRV_getExternalHS3MosfetOvercurrentSts(void);
INLINE uint8 BDRV_getLS1DrainSrcMonitoringSts(void);
INLINE uint8 BDRV_getHS1DrainSrcMonitoringSts(void);
INLINE uint8 BDRV_getLS2DrainSrcMonitoringSts(void);
INLINE uint8 BDRV_getHS2DrainSrcMonitoringSts(void);
INLINE uint8 BDRV_getLS3DrainSrcMonitoringSts(void);
INLINE uint8 BDRV_getHS3DrainSrcMonitoringSts(void);
INLINE uint8 BDRV_getSH1UndervoltageCompSts(void);
INLINE uint8 BDRV_getSH1OvervoltageCompSts(void);
INLINE uint8 BDRV_getSH2UndervoltageCompSts(void);
INLINE uint8 BDRV_getSH2OvervoltageCompSts(void);
INLINE uint8 BDRV_getSH3UndervoltageCompSts(void);
INLINE uint8 BDRV_getSH3OvervoltageCompSts(void);
INLINE uint8 BDRV_getCPOverTempSts(void);
INLINE uint8 BDRV_getVcpUndervoltageSts(void);
INLINE uint8 BDRV_getVcpOvervoltageSts(void);
INLINE uint8 BDRV_getVsdUndervoltageSts(void);
INLINE uint8 BDRV_getVsdOvervoltageSts(void);
INLINE uint8 BDRV_getVcpUndervoltageAnalogCompSts(void);
INLINE uint8 BDRV_getVsdOvervoltageCompSts(void);
INLINE void BDRV_clrExternalLS1MosfetOvercurrentSts(void);
INLINE void BDRV_clrExternalHS1MosfetOvercurrentSts(void);
INLINE void BDRV_clrExternalLS2MosfetOvercurrentSts(void);
INLINE void BDRV_clrExternalHS2MosfetOvercurrentSts(void);
INLINE void BDRV_clrExternalLS3MosfetOvercurrentSts(void);
INLINE void BDRV_clrExternalHS3MosfetOvercurrentSts(void);
INLINE void BDRV_clrLS1DrainSrcMonitoringSts(void);
INLINE void BDRV_clrHS1DrainSrcMonitoringSts(void);
INLINE void BDRV_clrLS2DrainSrcMonitoringSts(void);
INLINE void BDRV_clrHS2DrainSrcMonitoringSts(void);
INLINE void BDRV_clrLS3DrainSrcMonitoringSts(void);
INLINE void BDRV_clrHS3DrainSrcMonitoringSts(void);
INLINE void BDRV_clrCPUndervoltageCompSts(void);
INLINE uint8 BDRV_getExternalLS1MosfetOvercurrentIntSts(void);
INLINE uint8 BDRV_getExternalHS1MosfetOvercurrentIntSts(void);
INLINE uint8 BDRV_getExternalLS2MosfetOvercurrentIntSts(void);
INLINE uint8 BDRV_getExternalHS2MosfetOvercurrentIntSts(void);
INLINE uint8 BDRV_getExternalLS3MosfetOvercurrentIntSts(void);
INLINE uint8 BDRV_getExternalHS3MosfetOvercurrentIntSts(void);
INLINE uint8 BDRV_getLS1DrainSrcMonitoringIntSts(void);
INLINE uint8 BDRV_getHS1DrainSrcMonitoringIntSts(void);
INLINE uint8 BDRV_getLS2DrainSrcMonitoringIntSts(void);
INLINE uint8 BDRV_getHS2DrainSrcMonitoringIntSts(void);
INLINE uint8 BDRV_getLS3DrainSrcMonitoringIntSts(void);
INLINE uint8 BDRV_getHS3DrainSrcMonitoringIntSts(void);
INLINE uint8 BDRV_getHB1AdaptSeqIntSts(void);
INLINE uint8 BDRV_getHB2AdaptSeqIntSts(void);
INLINE uint8 BDRV_getHB3AdaptSeqIntSts(void);
INLINE uint8 BDRV_getHB1ActDrvDetectIntSts(void);
INLINE uint8 BDRV_getHB2ActDrvDetectIntSts(void);
INLINE uint8 BDRV_getHB3ActDrvDetectIntSts(void);
INLINE uint8 BDRV_getDrvSeqErrIntSts(void);
INLINE uint8 BDRV_getCPUndervoltageCompIntSts(void);
INLINE void BDRV_clrExternalLS1MosfetOvercurrentIntSts(void);
INLINE void BDRV_clrExternalHS1MosfetOvercurrentIntSts(void);
INLINE void BDRV_clrExternalLS2MosfetOvercurrentIntSts(void);
INLINE void BDRV_clrExternalHS2MosfetOvercurrentIntSts(void);
INLINE void BDRV_clrExternalLS3MosfetOvercurrentIntSts(void);
INLINE void BDRV_clrExternalHS3MosfetOvercurrentIntSts(void);
INLINE void BDRV_clrLS1DrainSrcMonitoringIntSts(void);
INLINE void BDRV_clrHS1DrainSrcMonitoringIntSts(void);
INLINE void BDRV_clrLS2DrainSrcMonitoringIntSts(void);
INLINE void BDRV_clrHS2DrainSrcMonitoringIntSts(void);
INLINE void BDRV_clrLS3DrainSrcMonitoringIntSts(void);
INLINE void BDRV_clrHS3DrainSrcMonitoringIntSts(void);
INLINE void BDRV_clrHB1AdaptSeqIntSts(void);
INLINE void BDRV_clrHB2AdaptSeqIntSts(void);
INLINE void BDRV_clrHB3AdaptSeqIntSts(void);
INLINE void BDRV_clrHB1ActDrvDetectIntSts(void);
INLINE void BDRV_clrHB2ActDrvDetectIntSts(void);
INLINE void BDRV_clrHB3ActDrvDetectIntSts(void);
INLINE void BDRV_clrDrvSeqErrIntSts(void);
INLINE void BDRV_clrCPUndervoltageCompIntSts(void);
INLINE uint8 BDRV_getHB1MaxT12ONReachedSts(void);
INLINE uint8 BDRV_getHB1MaxI1ONReachedSts(void);
INLINE uint8 BDRV_getHB1MinT12ONReachedSts(void);
INLINE uint8 BDRV_getHB1MinI1ONReachedSts(void);
INLINE uint8 BDRV_getHB1AdaptSeqChrgMeasFailSts(void);
INLINE uint8 BDRV_getHB1ChrgFailDrvSts(void);
INLINE uint8 BDRV_getHB2MaxT12ONReachedSts(void);
INLINE uint8 BDRV_getHB2MaxI1ONReachedSts(void);
INLINE uint8 BDRV_getHB2MinT12ONReachedSts(void);
INLINE uint8 BDRV_getHB2MinI1ONReachedSts(void);
INLINE uint8 BDRV_getHB2AdaptSeqChrgMeasFailSts(void);
INLINE uint8 BDRV_getHB2ChrgFailDrvSts(void);
INLINE uint8 BDRV_getHB3MaxT12ONReachedSts(void);
INLINE uint8 BDRV_getHB3MaxI1ONReachedSts(void);
INLINE uint8 BDRV_getHB3MinT12ONReachedSts(void);
INLINE uint8 BDRV_getHB3MinI1ONReachedSts(void);
INLINE uint8 BDRV_getHB3AdaptSeqChrgMeasFailSts(void);
INLINE uint8 BDRV_getHB3ChrgFailDrvSts(void);
INLINE uint8 BDRV_getHB1MaxT1OFFReachedSts(void);
INLINE uint8 BDRV_getHB1MaxI1OFFReachedSts(void);
INLINE uint8 BDRV_getHB1MinT1OFFReachedSts(void);
INLINE uint8 BDRV_getHB1MinI1OFFReachedSts(void);
INLINE uint8 BDRV_getHB1AdaptSeqDischrgMeasFailSts(void);
INLINE uint8 BDRV_getHB1DischrgFailDrvSts(void);
INLINE uint8 BDRV_getHB2MaxT1OFFReachedSts(void);
INLINE uint8 BDRV_getHB2MaxI1OFFReachedSts(void);
INLINE uint8 BDRV_getHB2MinT1OFFReachedSts(void);
INLINE uint8 BDRV_getHB2MinI1OFFReachedSts(void);
INLINE uint8 BDRV_getHB2AdaptSeqDischrgMeasFailSts(void);
INLINE uint8 BDRV_getHB2DischrgFailDrvSts(void);
INLINE uint8 BDRV_getHB3MaxT1OFFReachedSts(void);
INLINE uint8 BDRV_getHB3MaxI1OFFReachedSts(void);
INLINE uint8 BDRV_getHB3MinT1OFFReachedSts(void);
INLINE uint8 BDRV_getHB3MinI1OFFReachedSts(void);
INLINE uint8 BDRV_getHB3AdaptSeqDischrgMeasFailSts(void);
INLINE uint8 BDRV_getHB3DischrgFailDrvSts(void);
INLINE uint8 BDRV_getHB1ChrgDlyTime(void);
INLINE uint8 BDRV_getHB1ChrgPhase1Current(void);
INLINE uint8 BDRV_getHB1ChrgSlopeTime(void);
INLINE uint8 BDRV_getHB1ChrgSlopeTimeMeasErr(void);
INLINE uint8 BDRV_getHB1ChrgActiveDrv(void);
INLINE void BDRV_clrHB1ChrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB1ChrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB1DischrgDlyTime(void);
INLINE uint8 BDRV_getHB1DischrgPhase1Current(void);
INLINE uint8 BDRV_getHB1DischrgSlopeTime(void);
INLINE uint8 BDRV_getHB1DischrgSlopeTimeMeasErr(void);
INLINE uint8 BDRV_getHB1DischrgActiveDrv(void);
INLINE void BDRV_clrHB1DischrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB1DischrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB2ChrgDlyTime(void);
INLINE uint8 BDRV_getHB2ChrgPhase1Current(void);
INLINE uint8 BDRV_getHB2ChrgSlopeTime(void);
INLINE uint8 BDRV_getHB2ChrgSlopeTimeMeasErr(void);
INLINE uint8 BDRV_getHB2ChrgActiveDrv(void);
INLINE void BDRV_clrHB2ChrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB2ChrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB2DischrgDlyTime(void);
INLINE uint8 BDRV_getHB2DischrgPhase1Current(void);
INLINE uint8 BDRV_getHB2DischrgSlopeTime(void);
INLINE uint8 BDRV_getHB2DischrgSlopeTimeMeasErr(void);
INLINE uint8 BDRV_getHB2DischrgActiveDrv(void);
INLINE void BDRV_clrHB2DischrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB2DischrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB3ChrgDlyTime(void);
INLINE uint8 BDRV_getHB3ChrgPhase1Current(void);
INLINE uint8 BDRV_getHB3ChrgSlopeTime(void);
INLINE uint8 BDRV_getHB3ChrgSlopeTimeMeasErr(void);
INLINE uint8 BDRV_getHB3ChrgActiveDrv(void);
INLINE void BDRV_clrHB3ChrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB3ChrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB3DischrgDlyTime(void);
INLINE uint8 BDRV_getHB3DischrgPhase1Current(void);
INLINE uint8 BDRV_getHB3DischrgSlopeTime(void);
INLINE uint8 BDRV_getHB3DischrgSlopeTimeMeasErr(void);
INLINE uint8 BDRV_getHB3DischrgActiveDrv(void);
INLINE void BDRV_clrHB3DischrgTimeMeasValidSts(void);
INLINE uint8 BDRV_getHB3DischrgTimeMeasValidSts(void);

/*================================== BEMFC ===================================*/

INLINE void BDRV_enPh1ZCFallInt(void);
INLINE void BDRV_enPh1ZCRiseInt(void);
INLINE void BDRV_enPh2ZCFallInt(void);
INLINE void BDRV_enPh2ZCRiseInt(void);
INLINE void BDRV_enPh3ZCFallInt(void);
INLINE void BDRV_enPh3ZCRiseInt(void);
INLINE void BDRV_disPh1ZCFallInt(void);
INLINE void BDRV_disPh1ZCRiseInt(void);
INLINE void BDRV_disPh2ZCFallInt(void);
INLINE void BDRV_disPh2ZCRiseInt(void);
INLINE void BDRV_disPh3ZCFallInt(void);
INLINE void BDRV_disPh3ZCRiseInt(void);
INLINE uint8 BDRV_getPh1ZCCompSts(void);
INLINE uint8 BDRV_getPh2ZCCompSts(void);
INLINE uint8 BDRV_getPh3ZCCompSts(void);
INLINE uint8 BDRV_getPh1ZCFallIntSts(void);
INLINE uint8 BDRV_getPh1ZCRiseIntSts(void);
INLINE uint8 BDRV_getPh2ZCFallIntSts(void);
INLINE uint8 BDRV_getPh2ZCRiseIntSts(void);
INLINE uint8 BDRV_getPh3ZCFallIntSts(void);
INLINE uint8 BDRV_getPh3ZCRiseIntSts(void);
INLINE void BDRV_clrPh1ZCFallIntSts(void);
INLINE void BDRV_clrPh1ZCRiseIntSts(void);
INLINE void BDRV_clrPh2ZCFallIntSts(void);
INLINE void BDRV_clrPh2ZCRiseIntSts(void);
INLINE void BDRV_clrPh3ZCFallIntSts(void);
INLINE void BDRV_clrPh3ZCRiseIntSts(void);

