popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/*******************************************************************************
**                     Global Inline Function Definitions                     **
*******************************************************************************/

/*=================================== BDRV ===================================*/

/** \brief Enable External LS1 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_enExternalLS1MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.LS1_OC_IEN = 1u;
}

/** \brief Enable External HS1 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_enExternalHS1MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.HS1_OC_IEN = 1u;
}

/** \brief Enable External LS2 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_enExternalLS2MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.LS2_OC_IEN = 1u;
}

/** \brief Enable External HS2 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_enExternalHS2MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.HS2_OC_IEN = 1u;
}

/** \brief Enable External LS3 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_enExternalLS3MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.LS3_OC_IEN = 1u;
}

/** \brief Enable External HS3 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_enExternalHS3MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.HS3_OC_IEN = 1u;
}

/** \brief Enable LS1 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_enLS1DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.LS1_DS_IEN = 1u;
}

/** \brief Enable HS1 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_enHS1DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.HS1_DS_IEN = 1u;
}

/** \brief Enable LS2 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_enLS2DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.LS2_DS_IEN = 1u;
}

/** \brief Enable HS2 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_enHS2DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.HS2_DS_IEN = 1u;
}

/** \brief Enable LS3 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_enLS3DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.LS3_DS_IEN = 1u;
}

/** \brief Enable HS3 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_enHS3DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.HS3_DS_IEN = 1u;
}

/** \brief Enable HB1 Adaptive Sequencer Interrupt
 */
INLINE void BDRV_enHB1AdaptSeqInt(void)
{
  BDRV->IRQEN.bit.HB1_ASEQ_IEN = 1u;
}

/** \brief Enable HB1 Adaptive Sequencer Interrupt
 */
INLINE void BDRV_enHB2AdaptSeqInt(void)
{
  BDRV->IRQEN.bit.HB2_ASEQ_IEN = 1u;
}

/** \brief Enable HB1 Adaptive Sequencer Interrupt
 */
INLINE void BDRV_enHB3AdaptSeqInt(void)
{
  BDRV->IRQEN.bit.HB3_ASEQ_IEN = 1u;
}

/** \brief Enable HB1 Active Driver Detection Interrupt
 */
INLINE void BDRV_enHB1ActDrvDetectInt(void)
{
  BDRV->IRQEN.bit.HB1_ACTDRV_IEN = 1u;
}

/** \brief Enable HB2 Active Driver Detection Interrupt
 */
INLINE void BDRV_enHB2ActDrvDetectInt(void)
{
  BDRV->IRQEN.bit.HB2_ACTDRV_IEN = 1u;
}

/** \brief Enable HB3 Active Driver Detection Interrupt
 */
INLINE void BDRV_enHB3ActDrvDetectInt(void)
{
  BDRV->IRQEN.bit.HB3_ACTDRV_IEN = 1u;
}

/** \brief Enable Driver Sequence Error Interrupt
 */
INLINE void BDRV_enDrvSeqErrInt(void)
{
  BDRV->IRQEN.bit.SEQ_ERR_IEN = 1u;
}

/** \brief Enable Charge Pump Undervoltage Comparator Interrupt
 */
INLINE void BDRV_enCPUndervoltageCompInt(void)
{
  BDRV->IRQEN.bit.VCP_LOTH2_IEN = 1u;
}

/** \brief Disable External LS1 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_disExternalLS1MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.LS1_OC_IEN = 0u;
}

/** \brief Disable External HS1 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_disExternalHS1MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.HS1_OC_IEN = 0u;
}

/** \brief Disable External LS2 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_disExternalLS2MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.LS2_OC_IEN = 0u;
}

/** \brief Disable External HS2 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_disExternalHS2MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.HS2_OC_IEN = 0u;
}

/** \brief Disable External LS3 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_disExternalLS3MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.LS3_OC_IEN = 0u;
}

/** \brief Disable External HS3 MOSFET Overcurrent Interrupt
 */
INLINE void BDRV_disExternalHS3MosfetOvercurrentInt(void)
{
  BDRV->IRQEN.bit.HS3_OC_IEN = 0u;
}

/** \brief Disable LS1 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_disLS1DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.LS1_DS_IEN = 0u;
}

/** \brief Disable HS1 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_disHS1DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.HS1_DS_IEN = 0u;
}

/** \brief Disable LS2 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_disLS2DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.LS2_DS_IEN = 0u;
}

/** \brief Disable HS2 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_disHS2DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.HS2_DS_IEN = 0u;
}

/** \brief Disable LS3 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_disLS3DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.LS3_DS_IEN = 0u;
}

/** \brief Disable HS3 Drain Source Monitoring Interrupt
 */
INLINE void BDRV_disHS3DrainSrcMonitoringInt(void)
{
  BDRV->IRQEN.bit.HS3_DS_IEN = 0u;
}

/** \brief Disable HB1 Adaptive Sequencer Interrupt
 */
INLINE void BDRV_disHB1AdaptSeqInt(void)
{
  BDRV->IRQEN.bit.HB1_ASEQ_IEN = 0u;
}

/** \brief Disable HB1 Adaptive Sequencer Interrupt
 */
INLINE void BDRV_disHB2AdaptSeqInt(void)
{
  BDRV->IRQEN.bit.HB2_ASEQ_IEN = 0u;
}

/** \brief Disable HB1 Adaptive Sequencer Interrupt
 */
INLINE void BDRV_disHB3AdaptSeqInt(void)
{
  BDRV->IRQEN.bit.HB3_ASEQ_IEN = 0u;
}

/** \brief Disable HB1 Active Driver Detection Interrupt
 */
INLINE void BDRV_disHB1ActDrvDetectInt(void)
{
  BDRV->IRQEN.bit.HB1_ACTDRV_IEN = 0u;
}

/** \brief Disable HB2 Active Driver Detection Interrupt
 */
INLINE void BDRV_disHB2ActDrvDetectInt(void)
{
  BDRV->IRQEN.bit.HB2_ACTDRV_IEN = 0u;
}

/** \brief Disable HB3 Active Driver Detection Interrupt
 */
INLINE void BDRV_disHB3ActDrvDetectInt(void)
{
  BDRV->IRQEN.bit.HB3_ACTDRV_IEN = 0u;
}

/** \brief Disable Driver Sequence Error Interrupt
 */
INLINE void BDRV_disDrvSeqErrInt(void)
{
  BDRV->IRQEN.bit.SEQ_ERR_IEN = 0u;
}

/** \brief Disable Charge Pump Undervoltage Comparator Interrupt
 */
INLINE void BDRV_disCPUndervoltageCompInt(void)
{
  BDRV->IRQEN.bit.VCP_LOTH2_IEN = 0u;
}

