popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/** \brief Get External LS1 MOSFET Overcurrent Status BDRV.STS.LS1_OC_STS
 *
 * \return uint8 External LS1 MOSFET Overcurrent Status
 */
INLINE uint8 BDRV_getExternalLS1MosfetOvercurrentSts(void)
{
  return (uint8)BDRV->STS.bit.LS1_OC_STS;
}

/** \brief Get External HS1 MOSFET Overcurrent Status BDRV.STS.HS1_OC_STS
 *
 * \return uint8 External HS1 MOSFET Overcurrent Status
 */
INLINE uint8 BDRV_getExternalHS1MosfetOvercurrentSts(void)
{
  return (uint8)BDRV->STS.bit.HS1_OC_STS;
}

/** \brief Get External LS2 MOSFET Overcurrent Status BDRV.STS.LS2_OC_STS
 *
 * \return uint8 External LS2 MOSFET Overcurrent Status
 */
INLINE uint8 BDRV_getExternalLS2MosfetOvercurrentSts(void)
{
  return (uint8)BDRV->STS.bit.LS2_OC_STS;
}

/** \brief Get External HS2 MOSFET Overcurrent Status BDRV.STS.HS2_OC_STS
 *
 * \return uint8 External HS2 MOSFET Overcurrent Status
 */
INLINE uint8 BDRV_getExternalHS2MosfetOvercurrentSts(void)
{
  return (uint8)BDRV->STS.bit.HS2_OC_STS;
}

/** \brief Get External LS3 MOSFET Overcurrent Status BDRV.STS.LS3_OC_STS
 *
 * \return uint8 External LS3 MOSFET Overcurrent Status
 */
INLINE uint8 BDRV_getExternalLS3MosfetOvercurrentSts(void)
{
  return (uint8)BDRV->STS.bit.LS3_OC_STS;
}

/** \brief Get External HS3 MOSFET Overcurrent Status BDRV.STS.HS3_OC_STS
 *
 * \return uint8 External HS3 MOSFET Overcurrent Status
 */
INLINE uint8 BDRV_getExternalHS3MosfetOvercurrentSts(void)
{
  return (uint8)BDRV->STS.bit.HS3_OC_STS;
}

/** \brief Get LS1 Off-State Drain Source Monitoring Status BDRV.STS.LS1_DS_STS
 *
 * \return uint8 LS1 Off-State Drain Source Monitoring Status
 */
INLINE uint8 BDRV_getLS1DrainSrcMonitoringSts(void)
{
  return (uint8)BDRV->STS.bit.LS1_DS_STS;
}

/** \brief Get HS1 Off-State Drain Source Monitoring Status BDRV.STS.HS1_DS_STS
 *
 * \return uint8 HS1 Off-State Drain Source Monitoring Status
 */
INLINE uint8 BDRV_getHS1DrainSrcMonitoringSts(void)
{
  return (uint8)BDRV->STS.bit.HS1_DS_STS;
}

/** \brief Get LS2 Off-State Drain Source Monitoring Status BDRV.STS.LS2_DS_STS
 *
 * \return uint8 LS2 Off-State Drain Source Monitoring Status
 */
INLINE uint8 BDRV_getLS2DrainSrcMonitoringSts(void)
{
  return (uint8)BDRV->STS.bit.LS2_DS_STS;
}

/** \brief Get HS2 Off-State Drain Source Monitoring Status BDRV.STS.HS2_DS_STS
 *
 * \return uint8 HS2 Off-State Drain Source Monitoring Status
 */
INLINE uint8 BDRV_getHS2DrainSrcMonitoringSts(void)
{
  return (uint8)BDRV->STS.bit.HS2_DS_STS;
}

/** \brief Get LS3 Off-State Drain Source Monitoring Status BDRV.STS.LS3_DS_STS
 *
 * \return uint8 LS3 Off-State Drain Source Monitoring Status
 */
INLINE uint8 BDRV_getLS3DrainSrcMonitoringSts(void)
{
  return (uint8)BDRV->STS.bit.LS3_DS_STS;
}

/** \brief Get HS3 Off-State Drain Source Monitoring Status BDRV.STS.HS3_DS_STS
 *
 * \return uint8 HS3 Off-State Drain Source Monitoring Status
 */
INLINE uint8 BDRV_getHS3DrainSrcMonitoringSts(void)
{
  return (uint8)BDRV->STS.bit.HS3_DS_STS;
}

/** \brief Get SH1 Undervoltage Comparator Status BDRV.STS.SH1_LOW_STS
 *
 * \return uint8 SH1 Undervoltage Comparator Status
 */
INLINE uint8 BDRV_getSH1UndervoltageCompSts(void)
{
  return (uint8)BDRV->STS.bit.SH1_LOW_STS;
}

/** \brief Get SH1 Overvoltage Comparator Status BDRV.STS.SH1_HIGH_STS
 *
 * \return uint8 SH1 Overvoltage Comparator Status
 */
INLINE uint8 BDRV_getSH1OvervoltageCompSts(void)
{
  return (uint8)BDRV->STS.bit.SH1_HIGH_STS;
}

/** \brief Get SH2 Undervoltage Comparator Status BDRV.STS.SH2_LOW_STS
 *
 * \return uint8 SH2 Undervoltage Comparator Status
 */
INLINE uint8 BDRV_getSH2UndervoltageCompSts(void)
{
  return (uint8)BDRV->STS.bit.SH2_LOW_STS;
}

/** \brief Get SH2 Overvoltage Comparator Status BDRV.STS.SH2_HIGH_STS
 *
 * \return uint8 SH2 Overvoltage Comparator Status
 */
INLINE uint8 BDRV_getSH2OvervoltageCompSts(void)
{
  return (uint8)BDRV->STS.bit.SH2_HIGH_STS;
}

/** \brief Get SH3 Undervoltage Comparator Status BDRV.STS.SH3_LOW_STS
 *
 * \return uint8 SH3 Undervoltage Comparator Status
 */
INLINE uint8 BDRV_getSH3UndervoltageCompSts(void)
{
  return (uint8)BDRV->STS.bit.SH3_LOW_STS;
}

/** \brief Get SH3 Overvoltage Comparator Status BDRV.STS.SH3_HIGH_STS
 *
 * \return uint8 SH3 Overvoltage Comparator Status
 */
INLINE uint8 BDRV_getSH3OvervoltageCompSts(void)
{
  return (uint8)BDRV->STS.bit.SH3_HIGH_STS;
}

/** \brief Get Charge Pump Over Temperature Status BDRV.STS.CP_OTSD_STS
 *
 * \return uint8 Charge Pump Over Temperature Status
 */
INLINE uint8 BDRV_getCPOverTempSts(void)
{
  return (uint8)BDRV->STS.bit.CP_OTSD_STS;
}

/** \brief Get Vcp Undervoltage Status BDRV.STS.VCP_LOTH1_STS
 *
 * \return uint8 Vcp Undervoltage Status
 */
INLINE uint8 BDRV_getVcpUndervoltageSts(void)
{
  return (uint8)BDRV->STS.bit.VCP_LOTH1_STS;
}

/** \brief Get Vcp Overvoltage Status BDRV.STS.VCP_UPTH_STS
 *
 * \return uint8 Vcp Overvoltage Status
 */
INLINE uint8 BDRV_getVcpOvervoltageSts(void)
{
  return (uint8)BDRV->STS.bit.VCP_UPTH_STS;
}

/** \brief Get Vsd Undervoltage Status BDRV.STS.VSD_LOTH_STS
 *
 * \return uint8 Vsd Undervoltage Status
 */
INLINE uint8 BDRV_getVsdUndervoltageSts(void)
{
  return (uint8)BDRV->STS.bit.VSD_LOTH_STS;
}

/** \brief Get Vsd Overvoltage Status BDRV.STS.VSD_UPTH_STS
 *
 * \return uint8 Vsd Overvoltage Status
 */
INLINE uint8 BDRV_getVsdOvervoltageSts(void)
{
  return (uint8)BDRV->STS.bit.VSD_UPTH_STS;
}

/** \brief Get Vcp Undervoltage Analog Comparator Status BDRV.STS.VCP_LOTH2_STS
 *
 * \return uint8 Vcp Undervoltage Analog Comparator Status
 */
INLINE uint8 BDRV_getVcpUndervoltageAnalogCompSts(void)
{
  return (uint8)BDRV->STS.bit.VCP_LOTH2_STS;
}

/** \brief Get Vsd Overvoltage Comparator Status BDRV.STS.VSD_OV_STS
 *
 * \return uint8 Vsd Overvoltage Comparator Status
 */
INLINE uint8 BDRV_getVsdOvervoltageCompSts(void)
{
  return (uint8)BDRV->STS.bit.VSD_OV_STS;
}

/** \brief Clear External LS1 MOSFET Overcurrent Status BDRV.STSCLR.LS1_OC_SC
 */
INLINE void BDRV_clrExternalLS1MosfetOvercurrentSts(void)
{
  BDRV->STSCLR.bit.LS1_OC_SC = 1u;
}

/** \brief Clear External HS1 MOSFET Overcurrent Status BDRV.STSCLR.HS1_OC_SC
 */
INLINE void BDRV_clrExternalHS1MosfetOvercurrentSts(void)
{
  BDRV->STSCLR.bit.HS1_OC_SC = 1u;
}

