popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/** \brief Clear External LS2 MOSFET Overcurrent Status BDRV.STSCLR.LS2_OC_SC
 */
INLINE void BDRV_clrExternalLS2MosfetOvercurrentSts(void)
{
  BDRV->STSCLR.bit.LS2_OC_SC = 1u;
}

/** \brief Clear External HS2 MOSFET Overcurrent Status BDRV.STSCLR.HS2_OC_SC
 */
INLINE void BDRV_clrExternalHS2MosfetOvercurrentSts(void)
{
  BDRV->STSCLR.bit.HS2_OC_SC = 1u;
}

/** \brief Clear External LS3 MOSFET Overcurrent Status BDRV.STSCLR.LS3_OC_SC
 */
INLINE void BDRV_clrExternalLS3MosfetOvercurrentSts(void)
{
  BDRV->STSCLR.bit.LS3_OC_SC = 1u;
}

/** \brief Clear External HS3 MOSFET Overcurrent Status BDRV.STSCLR.HS3_OC_SC
 */
INLINE void BDRV_clrExternalHS3MosfetOvercurrentSts(void)
{
  BDRV->STSCLR.bit.HS3_OC_SC = 1u;
}

/** \brief Clear LS1 Off-State Drain Source Monitoring Status BDRV.STSCLR.LS1_DS_SC
 */
INLINE void BDRV_clrLS1DrainSrcMonitoringSts(void)
{
  BDRV->STSCLR.bit.LS1_DS_SC = 1u;
}

/** \brief Clear HS1 Off-State Drain Source Monitoring Status BDRV.STSCLR.HS1_DS_SC
 */
INLINE void BDRV_clrHS1DrainSrcMonitoringSts(void)
{
  BDRV->STSCLR.bit.HS1_DS_SC = 1u;
}

/** \brief Clear LS2 Off-State Drain Source Monitoring Status BDRV.STSCLR.LS2_DS_SC
 */
INLINE void BDRV_clrLS2DrainSrcMonitoringSts(void)
{
  BDRV->STSCLR.bit.LS2_DS_SC = 1u;
}

/** \brief Clear HS2 Off-State Drain Source Monitoring Status BDRV.STSCLR.HS2_DS_SC
 */
INLINE void BDRV_clrHS2DrainSrcMonitoringSts(void)
{
  BDRV->STSCLR.bit.HS2_DS_SC = 1u;
}

/** \brief Clear LS3 Off-State Drain Source Monitoring Status BDRV.STSCLR.LS3_DS_SC
 */
INLINE void BDRV_clrLS3DrainSrcMonitoringSts(void)
{
  BDRV->STSCLR.bit.LS3_DS_SC = 1u;
}

/** \brief Clear HS3 Off-State Drain Source Monitoring Status BDRV.STSCLR.HS3_DS_SC
 */
INLINE void BDRV_clrHS3DrainSrcMonitoringSts(void)
{
  BDRV->STSCLR.bit.HS3_DS_SC = 1u;
}

/** \brief Clear Charge Pump Undervoltage Comparator Status BDRV.STSCLR.VCP_LOTH2_SC
 */
INLINE void BDRV_clrCPUndervoltageCompSts(void)
{
  BDRV->STSCLR.bit.VCP_LOTH2_SC = 1u;
}

/** \brief Get External LS1 MOSFET Overcurrent Interrupt Status BDRV.IRQS.LS1_OC_IS
 *
 * \return uint8 External LS1 MOSFET Overcurrent Interrupt Status
 */
INLINE uint8 BDRV_getExternalLS1MosfetOvercurrentIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.LS1_OC_IS;
}

/** \brief Get External HS1 MOSFET Overcurrent Interrupt Status BDRV.IRQS.HS1_OC_IS
 *
 * \return uint8 External HS1 MOSFET Overcurrent Interrupt Status
 */
INLINE uint8 BDRV_getExternalHS1MosfetOvercurrentIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HS1_OC_IS;
}

/** \brief Get External LS2 MOSFET Overcurrent Interrupt Status BDRV.IRQS.LS2_OC_IS
 *
 * \return uint8 External LS2 MOSFET Overcurrent Interrupt Status
 */
INLINE uint8 BDRV_getExternalLS2MosfetOvercurrentIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.LS2_OC_IS;
}

/** \brief Get External HS2 MOSFET Overcurrent Interrupt Status BDRV.IRQS.HS2_OC_IS
 *
 * \return uint8 External HS2 MOSFET Overcurrent Interrupt Status
 */
INLINE uint8 BDRV_getExternalHS2MosfetOvercurrentIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HS2_OC_IS;
}

/** \brief Get External LS3 MOSFET Overcurrent Interrupt Status BDRV.IRQS.LS3_OC_IS
 *
 * \return uint8 External LS3 MOSFET Overcurrent Interrupt Status
 */
INLINE uint8 BDRV_getExternalLS3MosfetOvercurrentIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.LS3_OC_IS;
}

/** \brief Get External HS3 MOSFET Overcurrent Interrupt Status BDRV.IRQS.HS3_OC_IS
 *
 * \return uint8 External HS3 MOSFET Overcurrent Interrupt Status
 */
INLINE uint8 BDRV_getExternalHS3MosfetOvercurrentIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HS3_OC_IS;
}

/** \brief Get LS1 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQS.LS1_DS_IS
 *
 * \return uint8 LS1 Off-State Drain Source Monitoring Interrupt Status
 */
INLINE uint8 BDRV_getLS1DrainSrcMonitoringIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.LS1_DS_IS;
}

/** \brief Get HS1 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQS.HS1_DS_IS
 *
 * \return uint8 HS1 Off-State Drain Source Monitoring Interrupt Status
 */
INLINE uint8 BDRV_getHS1DrainSrcMonitoringIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HS1_DS_IS;
}

/** \brief Get LS2 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQS.LS2_DS_IS
 *
 * \return uint8 LS2 Off-State Drain Source Monitoring Interrupt Status
 */
INLINE uint8 BDRV_getLS2DrainSrcMonitoringIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.LS2_DS_IS;
}

/** \brief Get HS2 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQS.HS2_DS_IS
 *
 * \return uint8 HS2 Off-State Drain Source Monitoring Interrupt Status
 */
INLINE uint8 BDRV_getHS2DrainSrcMonitoringIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HS2_DS_IS;
}

/** \brief Get LS3 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQS.LS3_DS_IS
 *
 * \return uint8 LS3 Off-State Drain Source Monitoring Interrupt Status
 */
INLINE uint8 BDRV_getLS3DrainSrcMonitoringIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.LS3_DS_IS;
}

/** \brief Get HS3 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQS.HS3_DS_IS
 *
 * \return uint8 HS3 Off-State Drain Source Monitoring Interrupt Status
 */
INLINE uint8 BDRV_getHS3DrainSrcMonitoringIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HS3_DS_IS;
}

/** \brief Get HB1 Adaptive Sequencer Interrupt Status BDRV.IRQS.HB1_ASEQ_IS
 *
 * \return uint8 HB1 Adaptive Sequencer Interrupt Status
 */
INLINE uint8 BDRV_getHB1AdaptSeqIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HB1_ASEQ_IS;
}

/** \brief Get HB2 Adaptive Sequencer Interrupt Status BDRV.IRQS.HB2_ASEQ_IS
 *
 * \return uint8 HB2 Adaptive Sequencer Interrupt Status
 */
INLINE uint8 BDRV_getHB2AdaptSeqIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HB2_ASEQ_IS;
}

/** \brief Get HB3 Adaptive Sequencer Interrupt Status BDRV.IRQS.HB3_ASEQ_IS
 *
 * \return uint8 HB3 Adaptive Sequencer Interrupt Status
 */
INLINE uint8 BDRV_getHB3AdaptSeqIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HB3_ASEQ_IS;
}

/** \brief Get HB1 Active Driver Detection Interrupt Status BDRV.IRQS.HB1_ACTDRV_IS
 *
 * \return uint8 HB1 Active Driver Detection Interrupt Status
 */
INLINE uint8 BDRV_getHB1ActDrvDetectIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HB1_ACTDRV_IS;
}

/** \brief Get HB2 Active Driver Detection Interrupt Status BDRV.IRQS.HB2_ACTDRV_IS
 *
 * \return uint8 HB2 Active Driver Detection Interrupt Status
 */
INLINE uint8 BDRV_getHB2ActDrvDetectIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HB2_ACTDRV_IS;
}

/** \brief Get HB3 Active Driver Detection Interrupt Status BDRV.IRQS.HB3_ACTDRV_IS
 *
 * \return uint8 HB3 Active Driver Detection Interrupt Status
 */
INLINE uint8 BDRV_getHB3ActDrvDetectIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.HB3_ACTDRV_IS;
}

/** \brief Get Driver Sequence Error Interrupt Status BDRV.IRQS.SEQ_ERR_IS
 *
 * \return uint8 Driver Sequence Error Interrupt Status
 */
INLINE uint8 BDRV_getDrvSeqErrIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.SEQ_ERR_IS;
}

/** \brief Get Charge Pump Undervoltage Comparator Interrupt Status BDRV.IRQS.VCP_LOTH2_IS
 *
 * \return uint8 Charge Pump Undervoltage Comparator Interrupt Status
 */
INLINE uint8 BDRV_getCPUndervoltageCompIntSts(void)
{
  return (uint8)BDRV->IRQS.bit.VCP_LOTH2_IS;
}

