popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/** \brief Clear External LS1 MOSFET Overcurrent Interrupt Status BDRV.IRQCLR.LS1_OC_ISC
 */
INLINE void BDRV_clrExternalLS1MosfetOvercurrentIntSts(void)
{
  BDRV->IRQCLR.bit.LS1_OC_ISC = 1u;
}

/** \brief Clear External HS1 MOSFET Overcurrent Interrupt Status BDRV.IRQCLR.HS1_OC_ISC
 */
INLINE void BDRV_clrExternalHS1MosfetOvercurrentIntSts(void)
{
  BDRV->IRQCLR.bit.HS1_OC_ISC = 1u;
}

/** \brief Clear External LS2 MOSFET Overcurrent Interrupt Status BDRV.IRQCLR.LS2_OC_ISC
 */
INLINE void BDRV_clrExternalLS2MosfetOvercurrentIntSts(void)
{
  BDRV->IRQCLR.bit.LS2_OC_ISC = 1u;
}

/** \brief Clear External HS2 MOSFET Overcurrent Interrupt Status BDRV.IRQCLR.HS2_OC_ISC
 */
INLINE void BDRV_clrExternalHS2MosfetOvercurrentIntSts(void)
{
  BDRV->IRQCLR.bit.HS2_OC_ISC = 1u;
}

/** \brief Clear External LS3 MOSFET Overcurrent Interrupt Status BDRV.IRQCLR.LS3_OC_ISC
 */
INLINE void BDRV_clrExternalLS3MosfetOvercurrentIntSts(void)
{
  BDRV->IRQCLR.bit.LS3_OC_ISC = 1u;
}

/** \brief Clear External HS3 MOSFET Overcurrent Interrupt Status BDRV.IRQCLR.HS3_OC_ISC
 */
INLINE void BDRV_clrExternalHS3MosfetOvercurrentIntSts(void)
{
  BDRV->IRQCLR.bit.HS3_OC_ISC = 1u;
}

/** \brief Clear LS1 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQCLR.LS1_DS_ISC
 */
INLINE void BDRV_clrLS1DrainSrcMonitoringIntSts(void)
{
  BDRV->IRQCLR.bit.LS1_DS_ISC = 1u;
}

/** \brief Clear HS1 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQCLR.HS1_DS_ISC
 */
INLINE void BDRV_clrHS1DrainSrcMonitoringIntSts(void)
{
  BDRV->IRQCLR.bit.HS1_DS_ISC = 1u;
}

/** \brief Clear LS2 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQCLR.LS2_DS_ISC
 */
INLINE void BDRV_clrLS2DrainSrcMonitoringIntSts(void)
{
  BDRV->IRQCLR.bit.LS2_DS_ISC = 1u;
}

/** \brief Clear HS2 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQCLR.HS2_DS_ISC
 */
INLINE void BDRV_clrHS2DrainSrcMonitoringIntSts(void)
{
  BDRV->IRQCLR.bit.HS2_DS_ISC = 1u;
}

/** \brief Clear LS3 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQCLR.LS3_DS_ISC
 */
INLINE void BDRV_clrLS3DrainSrcMonitoringIntSts(void)
{
  BDRV->IRQCLR.bit.LS3_DS_ISC = 1u;
}

/** \brief Clear HS3 Off-State Drain Source Monitoring Interrupt Status BDRV.IRQCLR.HS3_DS_ISC
 */
INLINE void BDRV_clrHS3DrainSrcMonitoringIntSts(void)
{
  BDRV->IRQCLR.bit.HS3_DS_ISC = 1u;
}

/** \brief Clear HB1 Adaptive Sequencer Interrupt Status BDRV.IRQCLR.HB1_ASEQ_ISC
 */
INLINE void BDRV_clrHB1AdaptSeqIntSts(void)
{
  BDRV->IRQCLR.bit.HB1_ASEQ_ISC = 1u;
}

/** \brief Clear HB2 Adaptive Sequencer Interrupt Status BDRV.IRQCLR.HB2_ASEQ_ISC
 */
INLINE void BDRV_clrHB2AdaptSeqIntSts(void)
{
  BDRV->IRQCLR.bit.HB2_ASEQ_ISC = 1u;
}

/** \brief Clear HB3 Adaptive Sequencer Interrupt Status BDRV.IRQCLR.HB3_ASEQ_ISC
 */
INLINE void BDRV_clrHB3AdaptSeqIntSts(void)
{
  BDRV->IRQCLR.bit.HB3_ASEQ_ISC = 1u;
}

/** \brief Clear HB1 Active Driver Detection Interrupt Status BDRV.IRQCLR.HB1_ACTDRV_ISC
 */
INLINE void BDRV_clrHB1ActDrvDetectIntSts(void)
{
  BDRV->IRQCLR.bit.HB1_ACTDRV_ISC = 1u;
}

/** \brief Clear HB2 Active Driver Detection Interrupt Status BDRV.IRQCLR.HB2_ACTDRV_ISC
 */
INLINE void BDRV_clrHB2ActDrvDetectIntSts(void)
{
  BDRV->IRQCLR.bit.HB2_ACTDRV_ISC = 1u;
}

/** \brief Clear HB3 Active Driver Detection Interrupt Status BDRV.IRQCLR.HB3_ACTDRV_ISC
 */
INLINE void BDRV_clrHB3ActDrvDetectIntSts(void)
{
  BDRV->IRQCLR.bit.HB3_ACTDRV_ISC = 1u;
}

/** \brief Clear Driver Sequence Error Interrupt Status BDRV.IRQCLR.SEQ_ERR_ISC
 */
INLINE void BDRV_clrDrvSeqErrIntSts(void)
{
  BDRV->IRQCLR.bit.SEQ_ERR_ISC = 1u;
}

/** \brief Clear Charge Pump Undervoltage Comparator Interrupt Status BDRV.IRQCLR.VCP_LOTH2_ISC
 */
INLINE void BDRV_clrCPUndervoltageCompIntSts(void)
{
  BDRV->IRQCLR.bit.VCP_LOTH2_ISC = 1u;
}

/** \brief Get HB1 Max T12ON Value Reached BDRV.ASEQONSTS.HB1T12ONMAX
 *
 * \return uint8 HB1 Max T12ON Value Reached
 */
INLINE uint8 BDRV_getHB1MaxT12ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB1T12ONMAX;
}

/** \brief Get HB1 Max I1ON Value Reached BDRV.ASEQONSTS.HB1I1ONMAX
 *
 * \return uint8 HB1 Max I1ON Value Reached
 */
INLINE uint8 BDRV_getHB1MaxI1ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB1I1ONMAX;
}

/** \brief Get HB1 Min T12ON Value Reached BDRV.ASEQONSTS.HB1T12ONMIN
 *
 * \return uint8 HB1 Min T12ON Value Reached
 */
INLINE uint8 BDRV_getHB1MinT12ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB1T12ONMIN;
}

/** \brief Get HB1 Min I1ON Value Reached BDRV.ASEQONSTS.HB1I1ONMIN
 *
 * \return uint8 HB1 Min I1ON Value Reached
 */
INLINE uint8 BDRV_getHB1MinI1ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB1I1ONMIN;
}

/** \brief Get HB1 Adaptive Sequencer Switch-On Measurement Failure BDRV.ASEQONSTS.HB1ONMF
 *
 * \return uint8 HB1 Adaptive Sequencer Switch-On Measurement Failure
 */
INLINE uint8 BDRV_getHB1AdaptSeqChrgMeasFailSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB1ONMF;
}

/** \brief Get HB1 Failed Gate Driver During Switch-On BDRV.ASEQONSTS.HB1ONFAILDRV
 *
 * \return uint8 HB1 Failed Gate Driver During Switch-On
 */
INLINE uint8 BDRV_getHB1ChrgFailDrvSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB1ONFAILDRV;
}

/** \brief Get HB2 Max T12ON Value Reached BDRV.ASEQONSTS.HB2T12ONMAX
 *
 * \return uint8 HB2 Max T12ON Value Reached
 */
INLINE uint8 BDRV_getHB2MaxT12ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB2T12ONMAX;
}

/** \brief Get HB2 Max I1ON Value Reached BDRV.ASEQONSTS.HB2I1ONMAX
 *
 * \return uint8 HB2 Max I1ON Value Reached
 */
INLINE uint8 BDRV_getHB2MaxI1ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB2I1ONMAX;
}

/** \brief Get HB2 Min T12ON Value Reached BDRV.ASEQONSTS.HB2T12ONMIN
 *
 * \return uint8 HB2 Min T12ON Value Reached
 */
INLINE uint8 BDRV_getHB2MinT12ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB2T12ONMIN;
}

/** \brief Get HB2 Min I1ON Value Reached BDRV.ASEQONSTS.HB2I1ONMIN
 *
 * \return uint8 HB2 Min I1ON Value Reached
 */
INLINE uint8 BDRV_getHB2MinI1ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB2I1ONMIN;
}

