popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/** \brief Get HB2 Adaptive Sequencer Switch-On Measurement Failure BDRV.ASEQONSTS.HB2ONMF
 *
 * \return uint8 HB2 Adaptive Sequencer Switch-On Measurement Failure
 */
INLINE uint8 BDRV_getHB2AdaptSeqChrgMeasFailSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB2ONMF;
}

/** \brief Get HB2 Failed Gate Driver During Switch-On BDRV.ASEQONSTS.HB2ONFAILDRV
 *
 * \return uint8 HB2 Failed Gate Driver During Switch-On
 */
INLINE uint8 BDRV_getHB2ChrgFailDrvSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB2ONFAILDRV;
}

/** \brief Get HB3 Max T12ON Value Reached BDRV.ASEQONSTS.HB3T12ONMAX
 *
 * \return uint8 HB3 Max T12ON Value Reached
 */
INLINE uint8 BDRV_getHB3MaxT12ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB3T12ONMAX;
}

/** \brief Get HB3 Max I1ON Value Reached BDRV.ASEQONSTS.HB3I1ONMAX
 *
 * \return uint8 HB3 Max I1ON Value Reached
 */
INLINE uint8 BDRV_getHB3MaxI1ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB3I1ONMAX;
}

/** \brief Get HB3 Min T12ON Value Reached BDRV.ASEQONSTS.HB3T12ONMIN
 *
 * \return uint8 HB3 Min T12ON Value Reached
 */
INLINE uint8 BDRV_getHB3MinT12ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB3T12ONMIN;
}

/** \brief Get HB3 Min I1ON Value Reached BDRV.ASEQONSTS.HB3I1ONMIN
 *
 * \return uint8 HB3 Min I1ON Value Reached
 */
INLINE uint8 BDRV_getHB3MinI1ONReachedSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB3I1ONMIN;
}

/** \brief Get HB3 Adaptive Sequencer Switch-On Measurement Failure BDRV.ASEQONSTS.HB3ONMF
 *
 * \return uint8 HB3 Adaptive Sequencer Switch-On Measurement Failure
 */
INLINE uint8 BDRV_getHB3AdaptSeqChrgMeasFailSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB3ONMF;
}

/** \brief Get HB3 Failed Gate Driver During Switch-On BDRV.ASEQONSTS.HB3ONFAILDRV
 *
 * \return uint8 HB3 Failed Gate Driver During Switch-On
 */
INLINE uint8 BDRV_getHB3ChrgFailDrvSts(void)
{
  return (uint8)BDRV->ASEQONSTS.bit.HB3ONFAILDRV;
}

/** \brief Get HB1 Max T1OFF Value Reached BDRV.ASEQOFFSTS.HB1T1OFFMAX
 *
 * \return uint8 HB1 Max T1OFF Value Reached
 */
INLINE uint8 BDRV_getHB1MaxT1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB1T1OFFMAX;
}

/** \brief Get HB1 Max I1OFF Value Reached BDRV.ASEQOFFSTS.HB1I1OFFMAX
 *
 * \return uint8 HB1 Max I1OFF Value Reached
 */
INLINE uint8 BDRV_getHB1MaxI1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB1I1OFFMAX;
}

/** \brief Get HB1 Min T1OFF Value Reached BDRV.ASEQOFFSTS.HB1T1OFFMIN
 *
 * \return uint8 HB1 Min T1OFF Value Reached
 */
INLINE uint8 BDRV_getHB1MinT1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB1T1OFFMIN;
}

/** \brief Get HB1 Min I1OFF Value Reached BDRV.ASEQOFFSTS.HB1I1OFFMIN
 *
 * \return uint8 HB1 Min I1OFF Value Reached
 */
INLINE uint8 BDRV_getHB1MinI1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB1I1OFFMIN;
}

/** \brief Get HB1 Adaptive Sequencer Switch-Off Measurement Failure BDRV.ASEQOFFSTS.HB1OFFMF
 *
 * \return uint8 HB1 Adaptive Sequencer Switch-Off Measurement Failure
 */
INLINE uint8 BDRV_getHB1AdaptSeqDischrgMeasFailSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB1OFFMF;
}

/** \brief Get HB1 Failed Gate Driver During Switch-Off BDRV.ASEQOFFSTS.HB1OFFFAILDRV
 *
 * \return uint8 HB1 Failed Gate Driver During Switch-Off
 */
INLINE uint8 BDRV_getHB1DischrgFailDrvSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB1OFFFAILDRV;
}

/** \brief Get HB2 Max T1OFF Value Reached BDRV.ASEQOFFSTS.HB2T1OFFMAX
 *
 * \return uint8 HB2 Max T1OFF Value Reached
 */
INLINE uint8 BDRV_getHB2MaxT1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB2T1OFFMAX;
}

/** \brief Get HB2 Max I1OFF Value Reached BDRV.ASEQOFFSTS.HB2I1OFFMAX
 *
 * \return uint8 HB2 Max I1OFF Value Reached
 */
INLINE uint8 BDRV_getHB2MaxI1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB2I1OFFMAX;
}

/** \brief Get HB2 Min T1OFF Value Reached BDRV.ASEQOFFSTS.HB2T1OFFMIN
 *
 * \return uint8 HB2 Min T1OFF Value Reached
 */
INLINE uint8 BDRV_getHB2MinT1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB2T1OFFMIN;
}

/** \brief Get HB2 Min I1OFF Value Reached BDRV.ASEQOFFSTS.HB2I1OFFMIN
 *
 * \return uint8 HB2 Min I1OFF Value Reached
 */
INLINE uint8 BDRV_getHB2MinI1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB2I1OFFMIN;
}

/** \brief Get HB2 Adaptive Sequencer Switch-Off Measurement Failure BDRV.ASEQOFFSTS.HB2OFFMF
 *
 * \return uint8 HB2 Adaptive Sequencer Switch-Off Measurement Failure
 */
INLINE uint8 BDRV_getHB2AdaptSeqDischrgMeasFailSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB2OFFMF;
}

/** \brief Get HB2 Failed Gate Driver During Switch-Off BDRV.ASEQOFFSTS.HB2OFFFAILDRV
 *
 * \return uint8 HB2 Failed Gate Driver During Switch-Off
 */
INLINE uint8 BDRV_getHB2DischrgFailDrvSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB2OFFFAILDRV;
}

/** \brief Get HB3 Max T1OFF Value Reached BDRV.ASEQOFFSTS.HB3T1OFFMAX
 *
 * \return uint8 HB3 Max T1OFF Value Reached
 */
INLINE uint8 BDRV_getHB3MaxT1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB3T1OFFMAX;
}

/** \brief Get HB3 Max I1OFF Value Reached BDRV.ASEQOFFSTS.HB3I1OFFMAX
 *
 * \return uint8 HB3 Max I1OFF Value Reached
 */
INLINE uint8 BDRV_getHB3MaxI1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB3I1OFFMAX;
}

/** \brief Get HB3 Min T1OFF Value Reached BDRV.ASEQOFFSTS.HB3T1OFFMIN
 *
 * \return uint8 HB3 Min T1OFF Value Reached
 */
INLINE uint8 BDRV_getHB3MinT1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB3T1OFFMIN;
}

/** \brief Get HB3 Min I1OFF Value Reached BDRV.ASEQOFFSTS.HB3I1OFFMIN
 *
 * \return uint8 HB3 Min I1OFF Value Reached
 */
INLINE uint8 BDRV_getHB3MinI1OFFReachedSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB3I1OFFMIN;
}

/** \brief Get HB3 Adaptive Sequencer Switch-Off Measurement Failure BDRV.ASEQOFFSTS.HB3OFFMF
 *
 * \return uint8 HB3 Adaptive Sequencer Switch-Off Measurement Failure
 */
INLINE uint8 BDRV_getHB3AdaptSeqDischrgMeasFailSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB3OFFMF;
}

