popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/** \brief Get HB3 Failed Gate Driver During Switch-Off BDRV.ASEQOFFSTS.HB3OFFFAILDRV
 *
 * \return uint8 HB3 Failed Gate Driver During Switch-Off
 */
INLINE uint8 BDRV_getHB3DischrgFailDrvSts(void)
{
  return (uint8)BDRV->ASEQOFFSTS.bit.HB3OFFFAILDRV;
}

/** \brief Get HB1 Switch-On Delay Time Value Until Vsh Change BDRV.HB1ONVAL.HB1_TONDLY
 *
 * \return uint8 HB1 Switch-On Delay Time Value Until Vsh Change
 */
INLINE uint8 BDRV_getHB1ChrgDlyTime(void)
{
  return (uint8)BDRV->HB1ONVAL.bit.HB1_TONDLY;
}

/** \brief Get HB1 Switch-On Phase 1 Current Value From Adaptive Sequencer BDRV.HB1ONVAL.HB1_I1ONVAL
 *
 * \return uint8 HB1 Switch-On Phase 1 Current Value From Adaptive Sequencer
 */
INLINE uint8 BDRV_getHB1ChrgPhase1Current(void)
{
  return (uint8)BDRV->HB1ONVAL.bit.HB1_I1ONVAL;
}

/** \brief Get HB1 Switch-On Voltage Slope Time Value BDRV.HB1ONVAL.HB1_TONDUR
 *
 * \return uint8 HB1 Switch-On Voltage Slope Time Value
 */
INLINE uint8 BDRV_getHB1ChrgSlopeTime(void)
{
  return (uint8)BDRV->HB1ONVAL.bit.HB1_TONDUR;
}

/** \brief Get HB1 Switch-On Voltage Slope Time Measurement Value BDRV.HB1ONVAL.HB1_TONDURMERR
 *
 * \return uint8 HB1 Switch-On Voltage Slope Time Measurement Value
 */
INLINE uint8 BDRV_getHB1ChrgSlopeTimeMeasErr(void)
{
  return (uint8)BDRV->HB1ONVAL.bit.HB1_TONDURMERR;
}

/** \brief Get HB1 Switch-On Active Driver BDRV.HB1ONVAL.HB1_ACTDRV_ON
 *
 * \return uint8 HB1 Switch-On Active Driver
 */
INLINE uint8 BDRV_getHB1ChrgActiveDrv(void)
{
  return (uint8)BDRV->HB1ONVAL.bit.HB1_ACTDRV_ON;
}

/** \brief Clear HB1 Switch-On Measurement Values Valid Flag BDRV.HB1ONVAL.HB1_ONVALVF_CLR
 */
INLINE void BDRV_clrHB1ChrgTimeMeasValidSts(void)
{
  BDRV->HB1ONVAL.bit.HB1_ONVALVF_CLR = 1u;
}

/** \brief Get HB1 Switch-On Measurement Values Valid Flag BDRV.HB1ONVAL.HB1_ONVALVF
 *
 * \return uint8 HB1 Switch-On Measurement Values Valid Flag
 */
INLINE uint8 BDRV_getHB1ChrgTimeMeasValidSts(void)
{
  return (uint8)BDRV->HB1ONVAL.bit.HB1_ONVALVF;
}

/** \brief Get HB1 Switch-Off Delay Time Value Until Vsh Change BDRV.HB1OFFVAL.HB1_TOFFDLY
 *
 * \return uint8 HB1 Switch-Off Delay Time Value Until Vsh Change
 */
INLINE uint8 BDRV_getHB1DischrgDlyTime(void)
{
  return (uint8)BDRV->HB1OFFVAL.bit.HB1_TOFFDLY;
}

/** \brief Get HB1 Switch-Off Phase 1 Current Value From Adaptive Sequencer BDRV.HB1OFFVAL.HB1_I1OFFVAL
 *
 * \return uint8 HB1 Switch-Off Phase 1 Current Value From Adaptive Sequencer
 */
INLINE uint8 BDRV_getHB1DischrgPhase1Current(void)
{
  return (uint8)BDRV->HB1OFFVAL.bit.HB1_I1OFFVAL;
}

/** \brief Get HB1 Switch-Off Voltage Slope Time Value BDRV.HB1OFFVAL.HB1_TOFFDUR
 *
 * \return uint8 HB1 Switch-Off Voltage Slope Time Value
 */
INLINE uint8 BDRV_getHB1DischrgSlopeTime(void)
{
  return (uint8)BDRV->HB1OFFVAL.bit.HB1_TOFFDUR;
}

/** \brief Get HB1 Switch-Off Voltage Slope Time Measurement Value BDRV.HB1OFFVAL.HB1_TOFFDURMERR
 *
 * \return uint8 HB1 Switch-Off Voltage Slope Time Measurement Value
 */
INLINE uint8 BDRV_getHB1DischrgSlopeTimeMeasErr(void)
{
  return (uint8)BDRV->HB1OFFVAL.bit.HB1_TOFFDURMERR;
}

/** \brief Get HB1 Switch-Off Active Driver BDRV.HB1OFFVAL.HB1_ACTDRV_OFF
 *
 * \return uint8 HB1 Switch-Off Active Driver
 */
INLINE uint8 BDRV_getHB1DischrgActiveDrv(void)
{
  return (uint8)BDRV->HB1OFFVAL.bit.HB1_ACTDRV_OFF;
}

/** \brief Clear HB1 Switch-Off Measurement Values Valid Flag BDRV.HB1OFFVAL.HB1_OFFVALVF_CLR
 */
INLINE void BDRV_clrHB1DischrgTimeMeasValidSts(void)
{
  BDRV->HB1OFFVAL.bit.HB1_OFFVALVF_CLR = 1u;
}

/** \brief Get HB1 Switch-Off Measurement Values Valid Flag BDRV.HB1OFFVAL.HB1_OFFVALVF
 *
 * \return uint8 HB1 Switch-Off Measurement Values Valid Flag
 */
INLINE uint8 BDRV_getHB1DischrgTimeMeasValidSts(void)
{
  return (uint8)BDRV->HB1OFFVAL.bit.HB1_OFFVALVF;
}

/** \brief Get HB2 Switch-On Delay Time Value Until Vsh Change BDRV.HB2ONVAL.HB2_TONDLY
 *
 * \return uint8 HB2 Switch-On Delay Time Value Until Vsh Change
 */
INLINE uint8 BDRV_getHB2ChrgDlyTime(void)
{
  return (uint8)BDRV->HB2ONVAL.bit.HB2_TONDLY;
}

/** \brief Get HB2 Switch-On Phase 1 Current Value From Adaptive Sequencer BDRV.HB2ONVAL.HB2_I1ONVAL
 *
 * \return uint8 HB2 Switch-On Phase 1 Current Value From Adaptive Sequencer
 */
INLINE uint8 BDRV_getHB2ChrgPhase1Current(void)
{
  return (uint8)BDRV->HB2ONVAL.bit.HB2_I1ONVAL;
}

/** \brief Get HB2 Switch-On Voltage Slope Time Value BDRV.HB2ONVAL.HB2_TONDUR
 *
 * \return uint8 HB2 Switch-On Voltage Slope Time Value
 */
INLINE uint8 BDRV_getHB2ChrgSlopeTime(void)
{
  return (uint8)BDRV->HB2ONVAL.bit.HB2_TONDUR;
}

/** \brief Get HB2 Switch-On Voltage Slope Time Measurement Value BDRV.HB2ONVAL.HB2_TONDURMERR
 *
 * \return uint8 HB2 Switch-On Voltage Slope Time Measurement Value
 */
INLINE uint8 BDRV_getHB2ChrgSlopeTimeMeasErr(void)
{
  return (uint8)BDRV->HB2ONVAL.bit.HB2_TONDURMERR;
}

/** \brief Get HB2 Switch-On Active Driver BDRV.HB2ONVAL.HB2_ACTDRV_ON
 *
 * \return uint8 HB2 Switch-On Active Driver
 */
INLINE uint8 BDRV_getHB2ChrgActiveDrv(void)
{
  return (uint8)BDRV->HB2ONVAL.bit.HB2_ACTDRV_ON;
}

/** \brief Clear HB2 Switch-On Measurement Values Valid Flag BDRV.HB2ONVAL.HB2_ONVALVF_CLR
 */
INLINE void BDRV_clrHB2ChrgTimeMeasValidSts(void)
{
  BDRV->HB2ONVAL.bit.HB2_ONVALVF_CLR = 1u;
}

/** \brief Get HB2 Switch-On Measurement Values Valid Flag BDRV.HB2ONVAL.HB2_ONVALVF
 *
 * \return uint8 HB2 Switch-On Measurement Values Valid Flag
 */
INLINE uint8 BDRV_getHB2ChrgTimeMeasValidSts(void)
{
  return (uint8)BDRV->HB2ONVAL.bit.HB2_ONVALVF;
}

/** \brief Get HB2 Switch-Off Delay Time Value Until Vsh Change BDRV.HB2OFFVAL.HB2_TOFFDLY
 *
 * \return uint8 HB2 Switch-Off Delay Time Value Until Vsh Change
 */
INLINE uint8 BDRV_getHB2DischrgDlyTime(void)
{
  return (uint8)BDRV->HB2OFFVAL.bit.HB2_TOFFDLY;
}

/** \brief Get HB2 Switch-Off Phase 1 Current Value From Adaptive Sequencer BDRV.HB2OFFVAL.HB2_I1OFFVAL
 *
 * \return uint8 HB2 Switch-Off Phase 1 Current Value From Adaptive Sequencer
 */
INLINE uint8 BDRV_getHB2DischrgPhase1Current(void)
{
  return (uint8)BDRV->HB2OFFVAL.bit.HB2_I1OFFVAL;
}

/** \brief Get HB2 Switch-Off Voltage Slope Time Value BDRV.HB2OFFVAL.HB2_TOFFDUR
 *
 * \return uint8 HB2 Switch-Off Voltage Slope Time Value
 */
INLINE uint8 BDRV_getHB2DischrgSlopeTime(void)
{
  return (uint8)BDRV->HB2OFFVAL.bit.HB2_TOFFDUR;
}

