popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/** \brief Get HB2 Switch-Off Voltage Slope Time Measurement Value BDRV.HB2OFFVAL.HB2_TOFFDURMERR
 *
 * \return uint8 HB2 Switch-Off Voltage Slope Time Measurement Value
 */
INLINE uint8 BDRV_getHB2DischrgSlopeTimeMeasErr(void)
{
  return (uint8)BDRV->HB2OFFVAL.bit.HB2_TOFFDURMERR;
}

/** \brief Get HB2 Switch-Off Active Driver BDRV.HB2OFFVAL.HB2_ACTDRV_OFF
 *
 * \return uint8 HB2 Switch-Off Active Driver
 */
INLINE uint8 BDRV_getHB2DischrgActiveDrv(void)
{
  return (uint8)BDRV->HB2OFFVAL.bit.HB2_ACTDRV_OFF;
}

/** \brief Clear HB2 Switch-Off Measurement Values Valid Flag BDRV.HB2OFFVAL.HB2_OFFVALVF_CLR
 */
INLINE void BDRV_clrHB2DischrgTimeMeasValidSts(void)
{
  BDRV->HB2OFFVAL.bit.HB2_OFFVALVF_CLR = 1u;
}

/** \brief Get HB2 Switch-Off Measurement Values Valid Flag BDRV.HB2OFFVAL.HB2_OFFVALVF
 *
 * \return uint8 HB2 Switch-Off Measurement Values Valid Flag
 */
INLINE uint8 BDRV_getHB2DischrgTimeMeasValidSts(void)
{
  return (uint8)BDRV->HB2OFFVAL.bit.HB2_OFFVALVF;
}

/** \brief Get HB3 Switch-On Delay Time Value Until Vsh Change BDRV.HB3ONVAL.HB3_TONDLY
 *
 * \return uint8 HB3 Switch-On Delay Time Value Until Vsh Change
 */
INLINE uint8 BDRV_getHB3ChrgDlyTime(void)
{
  return (uint8)BDRV->HB3ONVAL.bit.HB3_TONDLY;
}

/** \brief Get HB3 Switch-On Phase 1 Current Value From Adaptive Sequencer BDRV.HB3ONVAL.HB3_I1ONVAL
 *
 * \return uint8 HB3 Switch-On Phase 1 Current Value From Adaptive Sequencer
 */
INLINE uint8 BDRV_getHB3ChrgPhase1Current(void)
{
  return (uint8)BDRV->HB3ONVAL.bit.HB3_I1ONVAL;
}

/** \brief Get HB3 Switch-On Voltage Slope Time Value BDRV.HB3ONVAL.HB3_TONDUR
 *
 * \return uint8 HB3 Switch-On Voltage Slope Time Value
 */
INLINE uint8 BDRV_getHB3ChrgSlopeTime(void)
{
  return (uint8)BDRV->HB3ONVAL.bit.HB3_TONDUR;
}

/** \brief Get HB3 Switch-On Voltage Slope Time Measurement Value BDRV.HB3ONVAL.HB3_TONDURMERR
 *
 * \return uint8 HB3 Switch-On Voltage Slope Time Measurement Value
 */
INLINE uint8 BDRV_getHB3ChrgSlopeTimeMeasErr(void)
{
  return (uint8)BDRV->HB3ONVAL.bit.HB3_TONDURMERR;
}

/** \brief Get HB3 Switch-On Active Driver BDRV.HB3ONVAL.HB3_ACTDRV_ON
 *
 * \return uint8 HB3 Switch-On Active Driver
 */
INLINE uint8 BDRV_getHB3ChrgActiveDrv(void)
{
  return (uint8)BDRV->HB3ONVAL.bit.HB3_ACTDRV_ON;
}

/** \brief Clear HB3 Switch-On Measurement Values Valid Flag BDRV.HB3ONVAL.HB3_ONVALVF_CLR
 */
INLINE void BDRV_clrHB3ChrgTimeMeasValidSts(void)
{
  BDRV->HB3ONVAL.bit.HB3_ONVALVF_CLR = 1u;
}

/** \brief Get HB3 Switch-On Measurement Values Valid Flag BDRV.HB3ONVAL.HB3_ONVALVF
 *
 * \return uint8 HB3 Switch-On Measurement Values Valid Flag
 */
INLINE uint8 BDRV_getHB3ChrgTimeMeasValidSts(void)
{
  return (uint8)BDRV->HB3ONVAL.bit.HB3_ONVALVF;
}

/** \brief Get HB3 Switch-Off Delay Time Value Until Vsh Change BDRV.HB3OFFVAL.HB3_TOFFDLY
 *
 * \return uint8 HB3 Switch-Off Delay Time Value Until Vsh Change
 */
INLINE uint8 BDRV_getHB3DischrgDlyTime(void)
{
  return (uint8)BDRV->HB3OFFVAL.bit.HB3_TOFFDLY;
}

/** \brief Get HB3 Switch-Off Phase 1 Current Value From Adaptive Sequencer BDRV.HB3OFFVAL.HB3_I1OFFVAL
 *
 * \return uint8 HB3 Switch-Off Phase 1 Current Value From Adaptive Sequencer
 */
INLINE uint8 BDRV_getHB3DischrgPhase1Current(void)
{
  return (uint8)BDRV->HB3OFFVAL.bit.HB3_I1OFFVAL;
}

/** \brief Get HB3 Switch-Off Voltage Slope Time Value BDRV.HB3OFFVAL.HB3_TOFFDUR
 *
 * \return uint8 HB3 Switch-Off Voltage Slope Time Value
 */
INLINE uint8 BDRV_getHB3DischrgSlopeTime(void)
{
  return (uint8)BDRV->HB3OFFVAL.bit.HB3_TOFFDUR;
}

/** \brief Get HB3 Switch-Off Voltage Slope Time Measurement Value BDRV.HB3OFFVAL.HB3_TOFFDURMERR
 *
 * \return uint8 HB3 Switch-Off Voltage Slope Time Measurement Value
 */
INLINE uint8 BDRV_getHB3DischrgSlopeTimeMeasErr(void)
{
  return (uint8)BDRV->HB3OFFVAL.bit.HB3_TOFFDURMERR;
}

/** \brief Get HB3 Switch-Off Active Driver BDRV.HB3OFFVAL.HB3_ACTDRV_OFF
 *
 * \return uint8 HB3 Switch-Off Active Driver
 */
INLINE uint8 BDRV_getHB3DischrgActiveDrv(void)
{
  return (uint8)BDRV->HB3OFFVAL.bit.HB3_ACTDRV_OFF;
}

/** \brief Clear HB3 Switch-Off Measurement Values Valid Flag BDRV.HB3OFFVAL.HB3_OFFVALVF_CLR
 */
INLINE void BDRV_clrHB3DischrgTimeMeasValidSts(void)
{
  BDRV->HB3OFFVAL.bit.HB3_OFFVALVF_CLR = 1u;
}

/** \brief Get HB3 Switch-Off Measurement Values Valid Flag BDRV.HB3OFFVAL.HB3_OFFVALVF
 *
 * \return uint8 HB3 Switch-Off Measurement Values Valid Flag
 */
INLINE uint8 BDRV_getHB3DischrgTimeMeasValidSts(void)
{
  return (uint8)BDRV->HB3OFFVAL.bit.HB3_OFFVALVF;
}

/*================================== BEMFC ===================================*/

/** \brief Enable Phase1 Zero Crossing Falling Interrupt
 */
INLINE void BDRV_enPh1ZCFallInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH1_ZCFALL_IEN = 1u;
}

/** \brief Enable Phase1 Zero Crossing Rising Interrupt
 */
INLINE void BDRV_enPh1ZCRiseInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH1_ZCRISE_IEN = 1u;
}

/** \brief Enable Phase2 Zero Crossing Falling Interrupt
 */
INLINE void BDRV_enPh2ZCFallInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH2_ZCFALL_IEN = 1u;
}

/** \brief Enable Phase2 Zero Crossing Rising Interrupt
 */
INLINE void BDRV_enPh2ZCRiseInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH2_ZCRISE_IEN = 1u;
}

/** \brief Enable Phase3 Zero Crossing Falling Interrupt
 */
INLINE void BDRV_enPh3ZCFallInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH3_ZCFALL_IEN = 1u;
}

/** \brief Enable Phase3 Zero Crossing Rising Interrupt
 */
INLINE void BDRV_enPh3ZCRiseInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH3_ZCRISE_IEN = 1u;
}

/** \brief Disable Phase1 Zero Crossing Falling Interrupt
 */
INLINE void BDRV_disPh1ZCFallInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH1_ZCFALL_IEN = 0u;
}

/** \brief Disable Phase1 Zero Crossing Rising Interrupt
 */
INLINE void BDRV_disPh1ZCRiseInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH1_ZCRISE_IEN = 0u;
}

/** \brief Disable Phase2 Zero Crossing Falling Interrupt
 */
INLINE void BDRV_disPh2ZCFallInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH2_ZCFALL_IEN = 0u;
}

/** \brief Disable Phase2 Zero Crossing Rising Interrupt
 */
INLINE void BDRV_disPh2ZCRiseInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH2_ZCRISE_IEN = 0u;
}

