popadaniel7/F93M8/FG_CAN/tsmaster_helpful_files/bootload2023.11.15/Bootload/RTE/Device/TLE9893_2QKW62/bdrv.h
/** \brief Disable Phase3 Zero Crossing Falling Interrupt
 */
INLINE void BDRV_disPh3ZCFallInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH3_ZCFALL_IEN = 0u;
}

/** \brief Disable Phase3 Zero Crossing Rising Interrupt
 */
INLINE void BDRV_disPh3ZCRiseInt(void)
{
  BDRV->BEMFC_IRQEN.bit.PH3_ZCRISE_IEN = 0u;
}

/** \brief Get Phase1 Zero Crossing Comparator Status BDRV.BEMFC_CTRL.PH1_ZC_STS
 *
 * \return uint8 Phase1 Zero Crossing Comparator Status
 */
INLINE uint8 BDRV_getPh1ZCCompSts(void)
{
  return (uint8)BDRV->BEMFC_CTRL.bit.PH1_ZC_STS;
}

/** \brief Get Phase2 Zero Crossing Comparator Status BDRV.BEMFC_CTRL.PH2_ZC_STS
 *
 * \return uint8 Phase2 Zero Crossing Comparator Status
 */
INLINE uint8 BDRV_getPh2ZCCompSts(void)
{
  return (uint8)BDRV->BEMFC_CTRL.bit.PH2_ZC_STS;
}

/** \brief Get Phase3 Zero Crossing Comparator Status BDRV.BEMFC_CTRL.PH3_ZC_STS
 *
 * \return uint8 Phase3 Zero Crossing Comparator Status
 */
INLINE uint8 BDRV_getPh3ZCCompSts(void)
{
  return (uint8)BDRV->BEMFC_CTRL.bit.PH3_ZC_STS;
}

/** \brief Get Phase1 Zero Crossing Falling Interrupt Status BDRV.BEMFC_IRQS.PH1_ZCFALL_IS
 *
 * \return uint8 Phase1 Zero Crossing Falling Interrupt Status
 */
INLINE uint8 BDRV_getPh1ZCFallIntSts(void)
{
  return (uint8)BDRV->BEMFC_IRQS.bit.PH1_ZCFALL_IS;
}

/** \brief Get Phase1 Zero Crossing Rising Interrupt Status BDRV.BEMFC_IRQS.PH1_ZCRISE_IS
 *
 * \return uint8 Phase1 Zero Crossing Rising Interrupt Status
 */
INLINE uint8 BDRV_getPh1ZCRiseIntSts(void)
{
  return (uint8)BDRV->BEMFC_IRQS.bit.PH1_ZCRISE_IS;
}

/** \brief Get Phase2 Zero Crossing Falling Interrupt Status BDRV.BEMFC_IRQS.PH2_ZCFALL_IS
 *
 * \return uint8 Phase2 Zero Crossing Falling Interrupt Status
 */
INLINE uint8 BDRV_getPh2ZCFallIntSts(void)
{
  return (uint8)BDRV->BEMFC_IRQS.bit.PH2_ZCFALL_IS;
}

/** \brief Get Phase2 Zero Crossing Rising Interrupt Status BDRV.BEMFC_IRQS.PH2_ZCRISE_IS
 *
 * \return uint8 Phase2 Zero Crossing Rising Interrupt Status
 */
INLINE uint8 BDRV_getPh2ZCRiseIntSts(void)
{
  return (uint8)BDRV->BEMFC_IRQS.bit.PH2_ZCRISE_IS;
}

/** \brief Get Phase3 Zero Crossing Falling Interrupt Status BDRV.BEMFC_IRQS.PH3_ZCFALL_IS
 *
 * \return uint8 Phase3 Zero Crossing Falling Interrupt Status
 */
INLINE uint8 BDRV_getPh3ZCFallIntSts(void)
{
  return (uint8)BDRV->BEMFC_IRQS.bit.PH3_ZCFALL_IS;
}

/** \brief Get Phase3 Zero Crossing Rising Interrupt Status BDRV.BEMFC_IRQS.PH3_ZCRISE_IS
 *
 * \return uint8 Phase3 Zero Crossing Rising Interrupt Status
 */
INLINE uint8 BDRV_getPh3ZCRiseIntSts(void)
{
  return (uint8)BDRV->BEMFC_IRQS.bit.PH3_ZCRISE_IS;
}

/** \brief Clear Phase1 Zero Crossing Falling Interrupt Status BDRV.BEMFC_IRQCLR.PH1_ZCFALL_ISC
 */
INLINE void BDRV_clrPh1ZCFallIntSts(void)
{
  BDRV->BEMFC_IRQCLR.bit.PH1_ZCFALL_ISC = 1u;
}

/** \brief Clear Phase1 Zero Crossing Rising Interrupt Status BDRV.BEMFC_IRQCLR.PH1_ZCRISE_ISC
 */
INLINE void BDRV_clrPh1ZCRiseIntSts(void)
{
  BDRV->BEMFC_IRQCLR.bit.PH1_ZCRISE_ISC = 1u;
}

/** \brief Clear Phase2 Zero Crossing Falling Interrupt Status BDRV.BEMFC_IRQCLR.PH2_ZCFALL_ISC
 */
INLINE void BDRV_clrPh2ZCFallIntSts(void)
{
  BDRV->BEMFC_IRQCLR.bit.PH2_ZCFALL_ISC = 1u;
}

/** \brief Clear Phase2 Zero Crossing Rising Interrupt Status BDRV.BEMFC_IRQCLR.PH2_ZCRISE_ISC
 */
INLINE void BDRV_clrPh2ZCRiseIntSts(void)
{
  BDRV->BEMFC_IRQCLR.bit.PH2_ZCRISE_ISC = 1u;
}

/** \brief Clear Phase3 Zero Crossing Falling Interrupt Status BDRV.BEMFC_IRQCLR.PH3_ZCFALL_ISC
 */
INLINE void BDRV_clrPh3ZCFallIntSts(void)
{
  BDRV->BEMFC_IRQCLR.bit.PH3_ZCFALL_ISC = 1u;
}

/** \brief Clear Phase3 Zero Crossing Rising Interrupt Status BDRV.BEMFC_IRQCLR.PH3_ZCRISE_ISC
 */
INLINE void BDRV_clrPh3ZCRiseIntSts(void)
{
  BDRV->BEMFC_IRQCLR.bit.PH3_ZCRISE_ISC = 1u;
}

/** @}*/

#endif /* _BDRV_H */
